Model: "model_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_9 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
conv2d_120 (Conv2D)          (None, 54, 54, 96)        34944     
_________________________________________________________________
spatial_dropout2d_8 (Spatial (None, 54, 54, 96)        0         
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 26, 26, 96)        0         
_________________________________________________________________
batch_normalization_99 (Batc (None, 26, 26, 96)        384       
_________________________________________________________________
conv2d_121 (Conv2D)          (None, 26, 26, 256)       614656    
_________________________________________________________________
spatial_dropout2d_9 (Spatial (None, 26, 26, 256)       0         
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 12, 12, 256)       0         
_________________________________________________________________
batch_normalization_100 (Bat (None, 12, 12, 256)       1024      
_________________________________________________________________
conv2d_122 (Conv2D)          (None, 12, 12, 384)       885120    
_________________________________________________________________
batch_normalization_101 (Bat (None, 12, 12, 384)       1536      
_________________________________________________________________
conv2d_123 (Conv2D)          (None, 12, 12, 384)       1327488   
_________________________________________________________________
batch_normalization_102 (Bat (None, 12, 12, 384)       1536      
_________________________________________________________________
conv2d_124 (Conv2D)          (None, 12, 12, 256)       884992    
_________________________________________________________________
batch_normalization_103 (Bat (None, 12, 12, 256)       1024      
_________________________________________________________________
max_pooling2d_30 (MaxPooling (None, 5, 5, 256)         0         
_________________________________________________________________
attention_block_7 (Attention (None, 5, 5, 256)         16672     
_________________________________________________________________
se_block_7 (SEBlock)         (None, 5, 5, 256)         8464      
_________________________________________________________________
custom_layer_10 (CustomLayer (None, 5, 5, 256)         16672     
_________________________________________________________________
custom_layer_11 (CustomLayer (None, 5, 5, 256)         8464      
_________________________________________________________________
flatten_12 (Flatten)         (None, 6400)              0         
_________________________________________________________________
dense_29 (Dense)             (None, 4096)              26218496  
_________________________________________________________________
dropout_30 (Dropout)         (None, 4096)              0         
_________________________________________________________________
dense_30 (Dense)             (None, 4096)              16781312  
_________________________________________________________________
dropout_31 (Dropout)         (None, 4096)              0         
_________________________________________________________________
dense_31 (Dense)             (None, 196)               803012    
=================================================================
Total params: 47,605,796
Trainable params: 47,603,044
Non-trainable params: 2,752
_________________________________________________________________
