Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_117 (Conv2D)          (None, 222, 222, 32)      896       
_________________________________________________________________
max_pooling2d_25 (MaxPooling (None, 111, 111, 32)      0         
_________________________________________________________________
dropout_27 (Dropout)         (None, 111, 111, 32)      0         
_________________________________________________________________
conv2d_118 (Conv2D)          (None, 109, 109, 64)      18496     
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 54, 54, 64)        0         
_________________________________________________________________
dropout_28 (Dropout)         (None, 54, 54, 64)        0         
_________________________________________________________________
conv2d_119 (Conv2D)          (None, 52, 52, 128)       73856     
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 26, 26, 128)       0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 86528)             0         
_________________________________________________________________
dense_27 (Dense)             (None, 512)               44302848  
_________________________________________________________________
dropout_29 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_28 (Dense)             (None, 196)               100548    
=================================================================
Total params: 44,496,644
Trainable params: 44,496,644
Non-trainable params: 0
_________________________________________________________________
